Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPolygonDefinition
Indicates how the structural section polygon contour is defined.
Since:
2027
Since:
2027

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPolygonDefinition.Circumscribed
Circumscribed polygon. Sides of the polygon are a specific distance from the center.

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionPolygonDefinition.Inscribed
Inscribed Polygon. The radius of the circle is measured to a vertex between sides of the polygon.